Revit 2027 API
BuiltInFailures.RebarFailures.RebarMovedBarsOverlapped Property
 There are identical overlapping bars in the rebar set. This will result in double counting in schedules.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId RebarMovedBarsOverlapped { get; }
Public Shared ReadOnly Property RebarMovedBarsOverlapped As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ RebarMovedBarsOverlapped {
	FailureDefinitionId^ get ();
}
static member RebarMovedBarsOverlapped : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.RebarFailures Class
Autodesk.Revit.DB Namespace